hrshygoodness/Luminary-Micro-Library/boards/ek-lm3s811/qs_ek-lm3s811/qs_ek-lm3s811.c
//*****************************************************************************
//
// qs_ek-lm3s811.c - The quick start application for the LM3S811 Evaluation
//                   Board.
//
// Copyright (c) 2006-2013 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 10636 of the EK-LM3S811 Firmware Package.
//
//*****************************************************************************

#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/adc.h"
#include "driverlib/debug.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/sysctl.h"
#include "driverlib/timer.h"
#include "driverlib/uart.h"
#include "drivers/display96x16x1.h"
#include "game.h"
#include "globals.h"
#include "random.h"
#include "screen_saver.h"

//*****************************************************************************
//
//! \addtogroup example_list
//! <h1>EK-LM3S811 Quickstart Application (qs_ek-lm3s811)</h1>
//!
//! A game in which a ship is navigated through an endless tunnel.  The
//! potentiometer is used to move the ship up and down, and the user push
//! button is used to fire a missile to destroy obstacles in the tunnel.  Score
//! accumulates for survival and for destroying obstacles.  The game lasts for
//! only one ship; the score is displayed on the virtual UART at 115,200, 8-N-1
//! during game play and will be displayed on the screen at the end of the
//! game.
//!
//! Since the OLED display on the evaluation board has burn-in characteristics
//! similar to a CRT, the application also contains a screen saver.  The screen
//! saver will only become active if two minutes have passed without the user
//! push button being pressed while waiting to start the game (that is, it will
//! never come on during game play).  An implementation of the Game of Life is
//! run with a field of random data as the seed value.
//!
//! After two minutes of running the screen saver, the display will be turned
//! off and the user LED will blink.  Either mode of screen saver (Game of Life
//! or blank display) will be exited by pressing the user push button.  The
//! button will then need to be pressed again to start the game.
//
//*****************************************************************************

//*****************************************************************************
//
// A bitmap for the Keil/ARM logo.  The bitmap is as follows:
//
//     x..xxxxxxxxxxxxxxx...
//     xx..x............x...
//     x.x..x...........x...
//     x..x..x..........x...
//     x...x..x.........x...
//     x....x..x........x...
//     x.....x..x.......x...
//     x......x..x......x...
//     x.....x..x.......x...
//     x....x..x........x...
//     x...x..x.........x...
//     x..x..x..........x...
//     x.x..x...........x...
//     xx..x............x...
//     x..xxxxxxxxxxxxxxx...
//     .....................
//
// Continued...
//
//     xxx.......xxxx....xxxxxxxxxxxxx....xxx....xxx..........
//     xxx.....xxxx......xxxxxxxxxxxxx....xxx....xxx..........
//     xxx...xxxx........xxx..............xxx....xxx..........
//     xxxxxxxx..........xxxxxxxxxxxxx....xxx....xxx..........
//     xxxxxxxx..........xxxxxxxxxxxxx....xxx....xxx..........
//     xxx...xxxx........xxx..............xxx....xxx..........
//     xxx.....xxxx......xxxxxxxxxxxxx....xxx....xxxxxxxxxxxxx
//     xxx.......xxxx....xxxxxxxxxxxxx....xxx....xxxxxxxxxxxxx
//     .......................................................
//     .......................................................
//     .x.........x..xx..x...x....xx..........................
//     x.x.......x.x.x.x.xx.xx...x............................
//     xxx.xx....xxx.xx..x.x.x...x....x..xx.x..xx...xx.xx..x.x
//     x.x.x.x...x.x.x.x.x...x...x...x.x.x.x.x.x.x.x.x.x.x.x.x
//     x.x.x.x...x.x.x.x.x...x....xx..x..x.x.x.xx...xx.x.x..x.
//     ........................................x...........x..
//
//*****************************************************************************
#if defined(rvmdk) || defined(__ARMCC_VERSION)
static const unsigned char g_pucKeilLogo[152] =
{
    0xff, 0x02, 0x04, 0x09, 0x13, 0x25, 0x49, 0x91, 0x21, 0x41, 0x81, 0x01,
    0x01, 0x01, 0x01, 0x01, 0x01, 0xff, 0x00, 0x00, 0x00, 0xff, 0xff, 0xff,
    0x18, 0x18, 0x18, 0x3c, 0x3c, 0x66, 0x66, 0xc3, 0xc3, 0x81, 0x81, 0x00,
    0x00, 0x00, 0x00, 0xff, 0xff, 0xff, 0xdb, 0xdb, 0xdb, 0xdb, 0xdb, 0xdb,
    0xdb, 0xdb, 0xdb, 0xdb, 0x00, 0x00, 0x00, 0x00, 0xff, 0xff, 0xff, 0x00,
    0x00, 0x00, 0x00, 0xff, 0xff, 0xff, 0xc0, 0xc0, 0xc0, 0xc0, 0xc0, 0xc0,
    0xc0, 0xc0, 0xc0, 0xc0,
    0x7f, 0x20, 0x10, 0x48, 0x64, 0x52, 0x49, 0x44, 0x42, 0x41, 0x40, 0x40,
    0x40, 0x40, 0x40, 0x40, 0x40, 0x7f, 0x00, 0x00, 0x00, 0x78, 0x14, 0x78,
    0x00, 0x70, 0x10, 0x60, 0x00, 0x00, 0x00, 0x78, 0x14, 0x78, 0x00, 0x7c,
    0x14, 0x68, 0x00, 0x7c, 0x08, 0x10, 0x08, 0x7c, 0x00, 0x00, 0x00, 0x38,
    0x44, 0x44, 0x00, 0x20, 0x50, 0x20, 0x00, 0x70, 0x10, 0x60, 0x10, 0x60,
    0x00, 0xf0, 0x50, 0x20, 0x00, 0x20, 0x50, 0x70, 0x00, 0x70, 0x10, 0x60,
    0x00, 0xb0, 0x40, 0x30
};
#endif

//*****************************************************************************
//
// A bitmap for the CodeSourcery logo.  The bitmap is as follows:
//
//    .....xxx....xx.........
//    ...xx......x..x........
//    ..x.......x............
//    .x.......x.............
//    .x......x..............
//    x......x...............
//    x.....x....xxx.........
//    x......xxxx...x........
//    x.............x........
//    .x...........x.........
//    .x..........x..........
//    ..x........x...........
//    ...xx.....x............
//    .....x...x.............
//    ........x..............
//    ........x..............
//
// Continued...
//
//    ............................................................
//    ...x..................x.....................................
//    ..x..................x......................................
//    .x..................x.......................................
//    .x....xx..xx...xxxx.x.....xx..x..x.xxx.....x.xxxx.xxx..x...x
//    x....x..x.x.x..x.....x...x..x.x..x.x..x...x..x....x..x.x...x
//    x....x..x.x..x.x.....x...x..x.x..x.x..x..x...x....x..x..x.x.
//    x....x..x.x..x.xxx...x...x..x.x..x.x..x..x...xxx..x..x...x..
//    x....x..x.x..x.x......x..x..x.x..x.xxx..x....x....xxx....x..
//    x....x..x.x..x.x......x..x..x.x..x.x..x.x....x....x..x...x..
//    x....x..x.x..x.x.......x.x..x.x..x.x..x.x....x....x..x...x..
//    x....x..x.x..x.x.......x.x..x.x..x.x..x.x....x....x..x...x..
//    .x...x..x.x.x..x.......x.x..x.x..x.x..x..x...x....x..x...x..
//    ..xx..xx..xx...xxxx...x...xx...xx..x..x...xx.xxxx.x..x...x..
//    ....................xx......................................
//    ............................................................
//
//*****************************************************************************
#if defined(sourcerygxx)
static const unsigned char g_pucCodeSourceryLogo[166] =
{
    0xe0, 0x18, 0x04, 0x02, 0x02, 0x01, 0x41, 0xa1, 0x90, 0x88, 0x84, 0x42,
    0x41, 0x41, 0x82, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xe0,
    0x18, 0x04, 0x02, 0x00, 0xe0, 0x10, 0x10, 0xe0, 0x00, 0xf0, 0x10, 0x20,
    0xc0, 0x00, 0xf0, 0x90, 0x90, 0x10, 0x00, 0x18, 0xe4, 0x02, 0x00, 0x00,
    0xe0, 0x10, 0x10, 0xe0, 0x00, 0xf0, 0x00, 0x00, 0xf0, 0x00, 0xf0, 0x10,
    0x10, 0xe0, 0x00, 0x00, 0xc0, 0x20, 0x10, 0x00, 0xf0, 0x90, 0x90, 0x10,
    0x00, 0xf0, 0x10, 0x10, 0xe0, 0x00, 0x30, 0x40, 0x80, 0x40, 0x30,
    0x01, 0x06, 0x08, 0x10, 0x10, 0x20, 0x00, 0x00, 0xc0, 0x20, 0x10, 0x08,
    0x04, 0x02, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x0f,
    0x10, 0x20, 0x20, 0x00, 0x1f, 0x20, 0x20, 0x1f, 0x00, 0x3f, 0x20, 0x10,
    0x0f, 0x00, 0x3f, 0x20, 0x20, 0x20, 0x00, 0x40, 0x40, 0x23, 0x1c, 0x00,
    0x1f, 0x20, 0x20, 0x1f, 0x00, 0x1f, 0x20, 0x20, 0x1f, 0x00, 0x3f, 0x01,
    0x01, 0x3e, 0x00, 0x0f, 0x10, 0x20, 0x20, 0x00, 0x3f, 0x20, 0x20, 0x20,
    0x00, 0x3f, 0x01, 0x01, 0x3e, 0x00, 0x00, 0x00, 0x3f, 0x00, 0x00
};
#endif

//*****************************************************************************
//
// A bitmap for the IAR logo.  The bitmap is as follows:
//
//     .......xxx................................
//     .....xxxxxxx..............................
//     ..x.xxxxxxxxx.x...........................
//     .xx.xxxxxxxxx.xx...xx....xxx....xxxxxx....
//     .xx...........xx...xx....xxx....xx...xx...
//     xxx.xxxxxxxxx.xxx..xx...xx.xx...xx...xx...
//     xxx.xxxxxxxxx.xxx..xx...xx.xx...xx...xx...
//     xxx...........xxx..xx...xx.xx...xx...xx...
//     xxx.xxxxxxxxx.xxx..xx..xx...xx..xxxxxx....
//     xxx...........xxx..xx..xx...xx..xx..xx....
//     xxx..xxxxxxx..xxx..xx..xxxxxxx..xx...xx...
//     .xxx.........xxx...xx.xx.....xx.xx...xx...
//     .xxxxx.....xxxxx...xx.xx.....xx.xx....xx..
//     ..xxxxxxxxxxxxx...........................
//     ....xxxxxxxxx.............................
//     ......xxxxx...............................
//
// Continued...
//
//     ..................................................
//     ..................................................
//     ..................................................
//     .xxxxx............................................
//     xx...xx................x..........................
//     xx....................xx..........................
//     xxx.....xx...xx.xxxx.xxxx..xxxx..xx.xxx.xx...xxxx.
//     .xxxx...xx...xxxx..xx.xx..xx..xx.xxx.xxx.xx.xx..xx
//     ..xxxx...xx.xx.xxx....xx..xx..xx.xx..xx..xx.xxx...
//     ....xxx..xx.xx..xxxx..xx..xxxxxx.xx..xx..xx..xxxx.
//     .....xx..xx.xx....xxx.xx..xx.....xx..xx..xx....xxx
//     xx...xx...xxx..xx..xx.xx..xx..xx.xx..xx..xx.xx..xx
//     .xxxxx....xxx...xxxx...xx..xxxx..xx..xx..xx..xxxx.
//     ..........xxx.....................................
//     ..........xx......................................
//     .........xx.......................................
//
//*****************************************************************************
#if defined(ewarm)
static const unsigned char g_pucIarLogo[184] = {
    0xe0, 0xf8, 0xfc, 0x00, 0x6c, 0x6e, 0x6e, 0x6f, 0x6f, 0x6f, 0x6e, 0x6e,
    0x6c, 0x00, 0xfc, 0xf8, 0xe0, 0x00, 0x00, 0xf8, 0xf8, 0x00, 0x00, 0x00,
    0xe0, 0xf8, 0x18, 0xf8, 0xe0, 0x00, 0x00, 0x00, 0xf8, 0xf8, 0x08, 0x08,
    0x08, 0xf8, 0xf0, 0x00, 0x00, 0x00, 0x70, 0xf8, 0xc8, 0x88, 0x88, 0x18,
    0x10, 0x00, 0xc0, 0xc0, 0x00, 0x00, 0x00, 0xc0, 0xc0, 0x80, 0xc0, 0x40,
    0x40, 0xc0, 0x80, 0x40, 0xe0, 0xf0, 0x40, 0x00, 0x80, 0xc0, 0x40, 0x40,
    0xc0, 0x80, 0x00, 0xc0, 0xc0, 0x80, 0x40, 0xc0, 0xc0, 0x80, 0x40, 0xc0,
    0x80, 0x00, 0x80, 0xc0, 0x40, 0x40, 0xc0, 0x80,
    0x07, 0x1f, 0x3f, 0x38, 0x71, 0x75, 0xe5, 0xe5, 0xe5, 0xe5, 0xe5, 0x75,
    0x71, 0x38, 0x3f, 0x1f, 0x07, 0x00, 0x00, 0x1f, 0x1f, 0x00, 0x18, 0x1f,
    0x07, 0x04, 0x04, 0x04, 0x07, 0x1f, 0x18, 0x00, 0x1f, 0x1f, 0x01, 0x01,
    0x03, 0x0f, 0x1c, 0x10, 0x00, 0x00, 0x08, 0x18, 0x11, 0x11, 0x13, 0x1f,
    0x0e, 0x00, 0x00, 0x87, 0xff, 0x78, 0x3f, 0x07, 0x00, 0x09, 0x1b, 0x13,
    0x16, 0x1e, 0x0c, 0x00, 0x0f, 0x1f, 0x10, 0x00, 0x0f, 0x1f, 0x12, 0x12,
    0x1b, 0x0b, 0x00, 0x1f, 0x1f, 0x00, 0x00, 0x1f, 0x1f, 0x00, 0x00, 0x1f,
    0x1f, 0x00, 0x09, 0x1b, 0x13, 0x16, 0x1e, 0x0c
};
#endif

//*****************************************************************************
//
// A bitmap for the code_red logo.  The bitmap is as follows:
//
//     ............................xxx...................
//     ............................xxx...................
//     ............................xxx...................
//     ............................xxx...................
//     ............................xxx...................
//     ...xxx....xxxxx.......xxxxx.xxx....xxxxx..........
//     .xxxxx...xxxxxxxx....xxxxxxxxxx...xx...xx.........
//     .xx.....xxx....xxx..xxx.....xxx..xx.....xx........
//     xxx.....xx......xx..xx......xxx..xxxxxxxxx........
//     xxx.....xx......xx..xx......xxx..xx...............
//     .xx.....xxx....xxx..xxx.....xxx..xx...............
//     .xxxxx...xxxxxxxx....xxxxxxxxxx...xx...xxx........
//     ...xxx....xxxxxx......xxxx..xxx....xxxxx..........
//     ..................................................
//     .........................................xxxxxxxx.
//     ..................................................
//
// Continued...
//
//     ..........................xxx
//     ..........................xxx
//     ..........................xxx
//     ..........................xxx
//     ..........................xxx
//     xx.xx....xxxxx......xxxxx.xxx
//     xxxxx...xx...xx....xxxxxxxxxx
//     xxx....xx.....xx..xxx.....xxx
//     xx.....xxxxxxxxx..xx......xxx
//     xx.....xx.........xx......xxx
//     xx.....xxx........xxx.....xxx
//     xx......xxxxxxx....xxxxxxxxxx
//     xx.......xxxx........xxxx.xxx
//     .............................
//     .............................
//     .............................
//
//*****************************************************************************
#if defined(codered)
static const unsigned char g_pucCodeRedLogo[156] =
{
    0x00, 0xc0, 0xc0, 0x60, 0x60, 0x60, 0x00, 0x00, 0x80, 0xc0, 0xe0, 0x60,
    0x60, 0x60, 0x60, 0xe0, 0xc0, 0x80, 0x00, 0x00, 0x80, 0xc0, 0xe0, 0x60,
    0x60, 0x60, 0x40, 0xff, 0xff, 0xff, 0x00, 0x00, 0x80, 0xc0, 0x60, 0x20,
    0x20, 0x20, 0x60, 0xc0, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0xe0, 0xe0, 0xc0, 0x60, 0x60, 0x00, 0x00, 0x80, 0xc0, 0x60,
    0x20, 0x20, 0x20, 0x60, 0xc0, 0x80, 0x00, 0x00, 0x80, 0xc0, 0xe0, 0x60,
    0x60, 0x60, 0x40, 0xff, 0xff, 0xff,
    0x03, 0x0f, 0x0f, 0x18, 0x18, 0x18, 0x00, 0x00, 0x07, 0x0f, 0x1c, 0x18,
    0x18, 0x18, 0x18, 0x1c, 0x0f, 0x07, 0x00, 0x00, 0x07, 0x0f, 0x1c, 0x18,
    0x18, 0x18, 0x08, 0x1f, 0x1f, 0x1f, 0x00, 0x00, 0x07, 0x0f, 0x19, 0x11,
    0x11, 0x11, 0x19, 0x09, 0x09, 0x40, 0x40, 0x40, 0x40, 0x40, 0x40, 0x40,
    0x40, 0x00, 0x1f, 0x1f, 0x00, 0x00, 0x00, 0x00, 0x00, 0x07, 0x0f, 0x19,
    0x11, 0x11, 0x11, 0x19, 0x09, 0x09, 0x00, 0x00, 0x07, 0x0f, 0x1c, 0x18,
    0x18, 0x18, 0x08, 0x1f, 0x1f, 0x1f
};
#endif

//*****************************************************************************
//
// A bitmap for the Code Composer Studio logo type.  The bitmap is as follows:
//
//    123456781234567812345678123456781234567812345678123456781234567812345678
//  0 ........................................................................
//  1 ........................................................................
//  2 ........................................................................
//  3 ..xxx..........x..........xxx.........................................xx
//  4 .x...x.........x.........x...x.......................................x..
//  5 x....x.........x........x....x.......................................x..
//  6 x.......xx...x.x..xx....x.......xx..x.x..xx.x.x...xx...xx...xx..x.x..x..
//  7 x......x..x.x.xx.x..x...x......x..x.xx.xx.x.xx.x.x..x.x..x.x..x.xx....xx
//  0 x......x..x.x..x.xxxx...x......x..x.x..x..x.x..x.x..x..x...xxxx.x.......
//  1 x....x.x..x.x..x.x......x....x.x..x.x..x..x.x..x.x..x...x..x....x....x..
//  2 .x...x.x..x.x.xx.x..x....x...x.x..x.x..x..x.xx.x.x..x.x..x.x..x.x....x..
//  3 ..xxx...xx...x.x..xx......xxx...xx..x..x..x.x.x...xx...xxx..xx..x.....xx
//  4 ............................................x...........................
//  5 ............................................x...........................
//  6 ............................................x...........................
//  7 ........................................................................
//
// Continued...
//    1234567812345678123456
//  0 ......................
//  1 ......................
//  2 ......................
//  3 x.............x.x.....
//  4 .x.x..........x.......
//  5 .x.x..........x.......
//  6 ..xxx.x..x..x.x.x..xx.
//  7 x..x..x..x.x.xx.x.x..x
//  0 .x.x..x..x.x..x.x.x..x
//  1 .x.x..x..x.x..x.x.x..x
//  2 .x.x..x.xx.x.xx.x.x..x
//  3 x..xx..x.x..x.x.x..xx.
//  4 ......................
//  5 ......................
//  6 ......................
//  7 ......................
//
//*****************************************************************************
#if defined(ccs)
static const unsigned char g_pucCodeComposerLogo[188] =
{
    //
    // Top Row
    //
    0xe0, 0x10, 0x08, 0x08, 0x08, 0x30, 0x00, 0x80,
    0x40, 0x40, 0x80, 0x00, 0x80, 0x40, 0x80, 0xf8,
    0x00, 0x80, 0x40, 0x40, 0x80, 0x00, 0x00, 0x00,
    0xe0, 0x10, 0x08, 0x08, 0x08, 0x30, 0x00, 0x80,
    0x40, 0x40, 0x80, 0x00, 0xc0, 0x80, 0x40, 0x80,
    0x80, 0x40, 0xc0, 0x00, 0xc0, 0x80, 0x40, 0x80,
    0x00, 0x80, 0x40, 0x40, 0x80, 0x00, 0x80, 0x40,
    0x40, 0x80, 0x00, 0x80, 0x40, 0x40, 0x80, 0x00,
    0xc0, 0x80, 0x40, 0x00, 0x00, 0x70, 0x88, 0x88,

    0x88, 0x30, 0x40, 0xf0, 0x40, 0x00, 0xc0, 0x00,
    0x00, 0xc0, 0x00, 0x80, 0x40, 0x80, 0xf8, 0x00,
    0xc8, 0x00, 0x80, 0x40, 0x40, 0x80,

    //
    // Second Row
    //
    0x03, 0x04, 0x08, 0x08, 0x08, 0x06, 0x00, 0x07,
    0x08, 0x08, 0x07, 0x00, 0x07, 0x08, 0x04, 0x0f,
    0x00, 0x07, 0x09, 0x09, 0x05, 0x00, 0x00, 0x00,
    0x03, 0x04, 0x08, 0x08, 0x08, 0x06, 0x00, 0x07,
    0x08, 0x08, 0x07, 0x00, 0x0f, 0x00, 0x00, 0x0f,
    0x00, 0x00, 0x0f, 0x00, 0x7f, 0x04, 0x08, 0x07,
    0x00, 0x07, 0x08, 0x08, 0x07, 0x00, 0x04, 0x09,
    0x0a, 0x0c, 0x00, 0x07, 0x09, 0x09, 0x05, 0x00,
    0x0f, 0x00, 0x00, 0x00, 0x00, 0x06, 0x08, 0x08,

    0x08, 0x07, 0x00, 0x0f, 0x08, 0x00, 0x07, 0x08,
    0x04, 0x0f, 0x00, 0x07, 0x08, 0x04, 0x0f, 0x00,
    0x0f, 0x00, 0x07, 0x08, 0x08, 0x07
};
#endif

//*****************************************************************************
//
// A bitmap for the Texas Instruments logo type.  The bitmap is as follows:
//
//    123456781234567812345678123456781234567812345678123456781234567812345678
//  0 .xxxxxxxxxxxx..............................................xxxxxx.......
//  1 .xxxxxxxxxxxxx.............................................xxxxx........
//  2 xx....xxx...xx..............................................xxx.........
//  3 x.....xxx..xxxxxxxxx.xxxxxx.xxxxx...xxx.......xxxxx.........xxx..xxx....
//  4 ......xxx..xxxxxxxxx.xxxxx..xxxxx...xxxx....xxxxxxxx........xxx..xxxx...
//  5 ......xxx...xxx...xxx.xxxx...xx....xxxxx....xxx.xxxx........xxx...xxxx..
//  6 ......xxx...xxx.....x..xxxx.xx.....xxxxx...xxx....xx........xxx...xxxxx.
//  7 ......xxx...xxx....x....xxxxxx.....xx.xxx..xxxxx............xxx...xxxxxx
//  0 ......xxx...xxxxxxxx.....xxxx.....xx..xxx...xxxxxxx.........xxx...xx.xxx
//  1 ......xxx...xxxxxxxx.....xxxx.....xx..xxxx...xxxxxxx........xxx...xx..xx
//  2 ......xxx...xxx....x....xxxxxx...xxxxxxxxx.....xxxxxx.......xxx...xx...x
//  3 ......xxx...xxx.........xx.xxx...xxxxxxxxx.xx.....xxx.......xxx...xx....
//  4 ......xxx...xxx.....xx.xx...xxx..xx....xxxxxx.....xxx.......xxx...xx....
//  5 .....xxxxx..xxxxxxxxx.xxx...xxxxxxx.....xxx.xxxxxxxx.......xxxxx..xx....
//  6 .....xxxxx.xxxxxxxxxxxxxx..xxxxxxxx....xxxxxxxxxxxx........xxxxx.xxxx...
//  7 ........................................................................
//
// Continued...
//    123456781234567812345678123456781234567812345678123456781234567812345678
//  0 ........................................................................
//  1 ........................................................................
//  2 ........................................................................
//  3 ..xxxx..xxxx...xxxxxxxxx.xxxxxxx....xxxxx...xxxxxxxx......xxxxxxxxxxxxx.
//  4 ..xxx..xxxxxxx.xxxxxxxxxxxxxxxxxxxx.xxxxx...xxxxxxxxx....xxxx.xxxxxxxxx.
//  5 ..xx.xxx..xxx.xx.xxx.xxx.xxxxxxxxx..xxx.....xx..xxxx....xxxxx..xxx...xxx
//  6 ..xx.xx.....xxx..xxx...x.xxx...xxxx.xxx.....xx..xxxxx...xxxxx..xxx.....x
//  7 ..xx.xxxx........xxx.....xxx...xxxx.xxx.....xx..xxxxx...xxxxx..xxx...xx.
//  0 x.xx.xxxxxxx.....xxx.....xxx..xxxx..xxx.....xx..xx.xxx.xx.xxx..xxxxxxxx.
//  1 xxxx..xxxxxxxx...xxx.....xxxxxxxx...xxx.....xx..xx.xxx.xx.xxx..xxx...xx.
//  2 xxxx.....xxxxx...xxx.....xxx.xxxx...xxx.....xx..xx.xxxxx..xxx..xxx......
//  3 xxxx.x.....xxx...xxx.....xxx..xxxx..xxx.....xx..xx..xxxx..xxx..xxx......
//  4 xxxx.xx... xxx...xxx.....xxx...xxx..xxx.....xx..xx..xxxx..xxx..xxx.....x
//  5 .xxx.xxxxxxxxx...xxx.....xxx...xxxx..xxxxxxxxx..xx....xx..xxx..xxxxxxxxx
//  6 ..xx..xxxxxx....xxxxx...xxxxx...xxxx..xxxxxxx..xxxx...xx.xxxxxxxxxxxxxxx
//  7 ........................................................................
//
// Continued...
//
//    12345678123456781234567812345678
//  0 ................................
//  1 ................................
//  2 ................................
//  3 xxxx....xxxx.xxxxxxxx...xxxx....
//  4 xxxxx...xxxxxxxxxxxxxx.xxxxxxxx.
//  5 .xxxxx...xx.xx. xxx.xx.xxx..xxx.
//  6 .xxxxx...xx.x...xxx..xxxx.....x.
//  7 .xx.xxx..xx.....xxx....xxxx.....
//  0 .xx.xxxx.xx.....xxx....xxxxxxx..
//  1 .xx..xxxxxx.....xxx.....xxxxxxx.
//  2 .xx...xxxxx.....xxx........xxxxx
//  3 .xx....xxxx.....xxx...xx.....xxx
//  4 .xx.....xxx.....xxx...xxx....xxx
//  5 .xx......xx.....xxx....xxxxxxxx.
//  6 xxxx.....xx....xxxxx...xxxxxxx..
//  7 ................................
//
//*****************************************************************************
static const unsigned char g_pucTILogo[] =
{
    //
    // Top Row (blank columns added to left and right edges)
    //
    0x00,
    0x0c, 0x07, 0x03, 0x03, 0x03, 0x03, 0xff, 0xff,
    0xff, 0x03, 0x03, 0x1b, 0xfe, 0xfe, 0xf8, 0x18,
    0x18, 0x18, 0x38, 0xb8, 0x60, 0x18, 0x38, 0x78,
    0xf8, 0xf8, 0xc8, 0x80, 0xd8, 0xf8, 0x38, 0x18,
    0x18, 0x00, 0x00, 0xe0, 0xf8, 0x78, 0xf8, 0xf0,
    0x80, 0x00, 0x00, 0xc0, 0xf0, 0xf0, 0xb8, 0x98,
    0x38, 0x38, 0x78, 0x70, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x03, 0xff, 0xff, 0xff, 0x03,
    0x01, 0x18, 0xf8, 0xf8, 0xf0, 0xe0, 0xc0, 0x80,

    0x00, 0x00, 0xf8, 0xf8, 0x18, 0xe8, 0xe0, 0xb0,
    0x98, 0x18, 0x38, 0x38, 0x70, 0x50, 0x60, 0x38,
    0x18, 0xf8, 0xf8, 0xf8, 0x18, 0x38, 0x38, 0x78,
    0x10, 0xf8, 0xf8, 0xf8, 0x38, 0x38, 0x38, 0xf8,
    0xf0, 0xf0, 0xd0, 0x00, 0xf8, 0xf8, 0xf8, 0x18,
    0x18, 0x00, 0x00, 0x00, 0xf8, 0xf8, 0x18, 0x18,
    0xf8, 0xf8, 0xf8, 0xf8, 0xd0, 0x00, 0x00, 0x00,
    0xe0, 0xf0, 0xf8, 0xf8, 0xf8, 0x08, 0x18, 0xf8,
    0xf8, 0xf8, 0x18, 0x18, 0x18, 0xb8, 0xb8, 0x60,

    0x18, 0xf8, 0xf8, 0x78, 0xf0, 0xe0, 0x80, 0x00,
    0x18, 0xf8, 0xf8, 0x18, 0x70, 0x38, 0x18, 0x18,
    0xf8, 0xf8, 0xf8, 0x18, 0x38, 0x70, 0x40, 0xf0,
    0xf8, 0xb8, 0x98, 0x18, 0x38, 0x30, 0x70, 0x00,
    0x00,

